Masmiseim36/nxpSDK/boards/evkmimxrt1180/component_examples/flash_component/lpspi_nor/cm33/pin_mux.h
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AON_05 (coord C7), SpiCsPin */
/* Routed pin properties */
#define BOARD_INITPINS_SpiCsPin_PERIPHERAL                                RGPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_SpiCsPin_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SpiCsPin_CHANNEL                                       5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SpiCsPin_GPIO                                      RGPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SpiCsPin_GPIO_PIN                                      5U   /*!< GPIO pin number */
#define BOARD_INITPINS_SpiCsPin_GPIO_PIN_MASK                         (1U << 5U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
